name: "resnet50_openvino"
backend: "openvino"
max_batch_size : 2
input [
  {
    name: "x"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]
output [
  {
    name: "x.45"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]

dynamic_batching { 
  max_queue_delay_microseconds: 5000
}

instance_group [{ 
  kind: KIND_CPU
  count: 2
}]