name: "resnet50_libtorch"
platform: "pytorch_libtorch"
max_batch_size : 8
input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]
output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]

dynamic_batching { 
  max_queue_delay_microseconds: 5000
}

instance_group [{ 
  kind: KIND_GPU
  count: 2
}]