name: "resnet50_libtorch"
platform: "pytorch_libtorch"
max_batch_size: 1
input {
  name: "input__0"
  data_type: TYPE_FP32
  dims: 3
  dims: 224
  dims: 224
}
output {
  name: "output__0"
  data_type: TYPE_FP32
  dims: 1000
}
instance_group {
  count: 1
  kind: KIND_GPU
}
