name: "resnet50_openvino"
max_batch_size: 1
input {
  name: "x"
  data_type: TYPE_FP32
  dims: 3
  dims: 224
  dims: 224
}
output {
  name: "x.45"
  data_type: TYPE_FP32
  dims: 1000
}
instance_group {
  count: 2
  kind: KIND_CPU
}
backend: "openvino"
